koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
/*
 * Copyright (C) 2018-2023 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: Device Configuration for STMicroelectronics STM32F4xx
 */

#ifndef DEVICE_CONFIG_H_
#define DEVICE_CONFIG_H_

/*******************************************************************************
 *  external declarations
 ******************************************************************************/

extern uint32_t osKernelGetSysTimerFreq(void);
extern uint32_t osKernelGetSysTimerCount(void);

/*******************************************************************************
 *  defines and macros
 ******************************************************************************/

#if !defined(RTE_HSI)
  #define RTE_HSI         ((uint32_t)16000000)  /* Default value of the Internal oscillator in Hz */
#endif  // RTE_HSI
#if !defined(RTE_HSE)
  #define RTE_HSE         ((uint32_t)8000000)   /* Default value of the External oscillator in Hz */
#endif  // RTE_HSE

/* Interrupt Priority */
#define RTE_I2C_INT_PRIORITY            (1U)
#define RTE_I2C_DMA_INT_PRIORITY        (1U)
#define RTE_I2S_INT_PRIORITY            (1U)
#define RTE_I2S_DMA_INT_PRIORITY        (1U)
#define RTE_USART_INT_PRIORITY          (1U)
#define RTE_USART_DMA_INT_PRIORITY      (1U)
#define RTE_SPI_INT_PRIORITY            (1U)
#define RTE_SPI_DMA_INT_PRIORITY        (1U)
#define RTE_USB_FS_INT_PRIORITY         (1U)
#define RTE_USB_FS_WKUP_INT_PRIORITY    (1U)
#define RTE_EXTI_INT_PRIORITY           (1U)

#define GetSysTimerFreq()               osKernelGetSysTimerFreq()
#define GetSysTimerCount()              osKernelGetSysTimerCount()

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

// <e> USART1 (Universal synchronous asynchronous receiver transmitter) [Driver_USART1]
// <i> Configuration settings for Driver_USART1 in component ::CMSIS Driver:USART
#define RTE_USART1                      0

//   <o> USART1_TX Pin <0=>Not Used <1=>PA9 <2=>PA15 <3=>PB6
#define   RTE_USART1_TX_ID              1
#if      (RTE_USART1_TX_ID == 0)
  #define RTE_USART1_TX                 0
#elif    (RTE_USART1_TX_ID == 1)
  #define RTE_USART1_TX                 1
  #define RTE_USART1_TX_PORT            GPIO_PORT_A
  #define RTE_USART1_TX_PIN             GPIO_PIN_9
  #define RTE_USART1_TX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART1_TX_ID == 2)
  #define RTE_USART1_TX                 1
  #define RTE_USART1_TX_PORT            GPIO_PORT_A
  #define RTE_USART1_TX_PIN             GPIO_PIN_15
  #define RTE_USART1_TX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART1_TX_ID == 3)
  #define RTE_USART1_TX                 1
  #define RTE_USART1_TX_PORT            GPIO_PORT_B
  #define RTE_USART1_TX_PIN             GPIO_PIN_6
  #define RTE_USART1_TX_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART1_TX Pin Configuration!"
#endif

//   <o> USART1_RX Pin <0=>Not Used <1=>PA10 <2=>PB3 <3=>PB7
#define   RTE_USART1_RX_ID              1
#if      (RTE_USART1_RX_ID == 0)
  #define RTE_USART1_RX                 0
#elif    (RTE_USART1_RX_ID == 1)
  #define RTE_USART1_RX                 1
  #define RTE_USART1_RX_PORT            GPIO_PORT_A
  #define RTE_USART1_RX_PIN             GPIO_PIN_10
  #define RTE_USART1_RX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART1_RX_ID == 2)
  #define RTE_USART1_RX                 1
  #define RTE_USART1_RX_PORT            GPIO_PORT_B
  #define RTE_USART1_RX_PIN             GPIO_PIN_3
  #define RTE_USART1_RX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART1_RX_ID == 3)
  #define RTE_USART1_RX                 1
  #define RTE_USART1_RX_PORT            GPIO_PORT_B
  #define RTE_USART1_RX_PIN             GPIO_PIN_7
  #define RTE_USART1_RX_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART1_RX Pin Configuration!"
#endif

//   <o> USART1_CK Pin <0=>Not Used <1=>PA8
#define   RTE_USART1_CK_ID              1
#if      (RTE_USART1_CK_ID == 0)
  #define RTE_USART1_CK                 0
#elif    (RTE_USART1_CK_ID == 1)
  #define RTE_USART1_CK                 1
  #define RTE_USART1_CK_PORT            GPIO_PORT_A
  #define RTE_USART1_CK_PIN             GPIO_PIN_8
  #define RTE_USART1_CK_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART1_CK Pin Configuration!"
#endif

//   <o> USART1_CTS Pin <0=>Not Used <1=>PA11
#define   RTE_USART1_CTS_ID             1
#if      (RTE_USART1_CTS_ID == 0)
  #define RTE_USART1_CTS                0
#elif    (RTE_USART1_CTS_ID == 1)
  #define RTE_USART1_CTS                1
  #define RTE_USART1_CTS_PORT           GPIO_PORT_A
  #define RTE_USART1_CTS_PIN            GPIO_PIN_11
  #define RTE_USART1_CTS_FUNC           GPIO_PIN_FUNC_7
#else
  #error "Invalid USART1_CTS Pin Configuration!"
#endif

//   <o> USART1_RTS Pin <0=>Not Used <1=>PA12
#define   RTE_USART1_RTS_ID             1
#if      (RTE_USART1_RTS_ID == 0)
  #define RTE_USART1_RTS                0
#elif    (RTE_USART1_RTS_ID == 1)
  #define RTE_USART1_RTS                1
  #define RTE_USART1_RTS_PORT           GPIO_PORT_A
  #define RTE_USART1_RTS_PIN            GPIO_PIN_12
  #define RTE_USART1_RTS_FUNC           GPIO_PIN_FUNC_7
#else
  #error "Invalid USART1_RTS Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <2=>2 <5=>5
//     <i>  Selects DMA Stream (only Stream 2 or 5 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART1_RX_DMA               0
#define RTE_USART1_RX_DMA_NUMBER        2
#define RTE_USART1_RX_DMA_STREAM        2
#define RTE_USART1_RX_DMA_CHANNEL       4
#define RTE_USART1_RX_DMA_PRIORITY      0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART1_TX_DMA               0
#define RTE_USART1_TX_DMA_NUMBER        2
#define RTE_USART1_TX_DMA_STREAM        7
#define RTE_USART1_TX_DMA_CHANNEL       4
#define RTE_USART1_TX_DMA_PRIORITY      0

// </e> USART1 (Universal synchronous asynchronous receiver transmitter) [Driver_USART1]

// <e> USART2 (Universal synchronous asynchronous receiver transmitter) [Driver_USART2]
// <i> Configuration settings for Driver_USART2 in component ::CMSIS Driver:USART
#define RTE_USART2                      0

//   <o> USART2_TX Pin <0=>Not Used <1=>PA2 <2=>PD5
#define   RTE_USART2_TX_ID              1
#if      (RTE_USART2_TX_ID == 0)
  #define RTE_USART2_TX                 0
#elif    (RTE_USART2_TX_ID == 1)
  #define RTE_USART2_TX                 1
  #define RTE_USART2_TX_PORT            GPIO_PORT_A
  #define RTE_USART2_TX_PIN             GPIO_PIN_2
  #define RTE_USART2_TX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART2_TX_ID == 2)
  #define RTE_USART2_TX                 1
  #define RTE_USART2_TX_PORT            GPIO_PORT_D
  #define RTE_USART2_TX_PIN             GPIO_PIN_5
  #define RTE_USART2_TX_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART2_TX Pin Configuration!"
#endif

//   <o> USART2_RX Pin <0=>Not Used <1=>PA3 <2=>PD6
#define   RTE_USART2_RX_ID              1
#if      (RTE_USART2_RX_ID == 0)
  #define RTE_USART2_RX                 0
#elif    (RTE_USART2_RX_ID == 1)
  #define RTE_USART2_RX                 1
  #define RTE_USART2_RX_PORT            GPIO_PORT_A
  #define RTE_USART2_RX_PIN             GPIO_PIN_3
  #define RTE_USART2_RX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART2_RX_ID == 2)
  #define RTE_USART2_RX                 1
  #define RTE_USART2_RX_PORT            GPIO_PORT_D
  #define RTE_USART2_RX_PIN             GPIO_PIN_6
  #define RTE_USART2_RX_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART2_RX Pin Configuration!"
#endif

