koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
//   <o> USART2_CK Pin <0=>Not Used <1=>PA4 <2=>PD7
#define   RTE_USART2_CK_ID              0
#if      (RTE_USART2_CK_ID == 0)
  #define RTE_USART2_CK                 0
#elif    (RTE_USART2_CK_ID == 1)
  #define RTE_USART2_CK                 1
  #define RTE_USART2_CK_PORT            GPIO_PORT_A
  #define RTE_USART2_CK_PIN             GPIO_PIN_4
  #define RTE_USART2_CK_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART2_CK_ID == 2)
  #define RTE_USART2_CK                 1
  #define RTE_USART2_CK_PORT            GPIO_PORT_D
  #define RTE_USART2_CK_PIN             GPIO_PIN_7
  #define RTE_USART2_CK_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART2_CK Pin Configuration!"
#endif

//   <o> USART2_CTS Pin <0=>Not Used <1=>PA0 <2=>PD3
#define   RTE_USART2_CTS_ID             0
#if      (RTE_USART2_CTS_ID == 0)
  #define RTE_USART2_CTS                0
#elif    (RTE_USART2_CTS_ID == 1)
  #define RTE_USART2_CTS                1
  #define RTE_USART2_CTS_PORT           GPIO_PORT_A
  #define RTE_USART2_CTS_PIN            GPIO_PIN_0
  #define RTE_USART2_CTS_FUNC           GPIO_PIN_FUNC_7
#elif    (RTE_USART2_CTS_ID == 2)
  #define RTE_USART2_CTS                1
  #define RTE_USART2_CTS_PORT           GPIO_PORT_D
  #define RTE_USART2_CTS_PIN            GPIO_PIN_3
  #define RTE_USART2_CTS_FUNC           GPIO_PIN_FUNC_7
#else
  #error "Invalid USART2_CTS Pin Configuration!"
#endif

//   <o> USART2_RTS Pin <0=>Not Used <1=>PA1 <2=>PD4
#define   RTE_USART2_RTS_ID             0
#if      (RTE_USART2_RTS_ID == 0)
  #define RTE_USART2_RTS                0
#elif    (RTE_USART2_RTS_ID == 1)
  #define RTE_USART2_RTS                1
  #define RTE_USART2_RTS_PORT           GPIO_PORT_A
  #define RTE_USART2_RTS_PIN            GPIO_PIN_1
  #define RTE_USART2_RTS_FUNC           GPIO_PIN_FUNC_7
#elif    (RTE_USART2_RTS_ID == 2)
  #define RTE_USART2_RTS                1
  #define RTE_USART2_RTS_PORT           GPIO_PORT_D
  #define RTE_USART2_RTS_PIN            GPIO_PIN_4
  #define RTE_USART2_RTS_FUNC           GPIO_PIN_FUNC_7
#else
  #error "Invalid USART2_RTS Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <5=>5 <7=>7
//     <i>  Selects DMA Stream (only Stream 5 or 7 can be used)
//     <o3> Channel <4=>4 <6=>6
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART2_RX_DMA               0
#define RTE_USART2_RX_DMA_NUMBER        1
#define RTE_USART2_RX_DMA_STREAM        5
#define RTE_USART2_RX_DMA_CHANNEL       4
#define RTE_USART2_RX_DMA_PRIORITY      0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <6=>6
//     <i>  Selects DMA Stream (only Stream 6 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART2_TX_DMA               0
#define RTE_USART2_TX_DMA_NUMBER        1
#define RTE_USART2_TX_DMA_STREAM        6
#define RTE_USART2_TX_DMA_CHANNEL       4
#define RTE_USART2_TX_DMA_PRIORITY      0

// </e> USART2 (Universal synchronous asynchronous receiver transmitter) [Driver_USART2]

// <e> USART3 (Universal synchronous asynchronous receiver transmitter) [Driver_USART3]
// <i> Configuration settings for Driver_USART3 in component ::CMSIS Driver:USART
#define RTE_USART3                      0

//   <o> USART3_TX Pin <0=>Not Used <1=>PB10 <2=>PC10 <3=>PD8
#define   RTE_USART3_TX_ID              0
#if      (RTE_USART3_TX_ID == 0)
  #define RTE_USART3_TX                 0
#elif    (RTE_USART3_TX_ID == 1)
  #define RTE_USART3_TX                 1
  #define RTE_USART3_TX_PORT            GPIO_PORT_B
  #define RTE_USART3_TX_PIN             GPIO_PIN_10
  #define RTE_USART3_TX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART3_TX_ID == 2)
  #define RTE_USART3_TX                 1
  #define RTE_USART3_TX_PORT            GPIO_PORT_C
  #define RTE_USART3_TX_PIN             GPIO_PIN_10
  #define RTE_USART3_TX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART3_TX_ID == 3)
  #define RTE_USART3_TX                 1
  #define RTE_USART3_TX_PORT            GPIO_PORT_D
  #define RTE_USART3_TX_PIN             GPIO_PIN_8
  #define RTE_USART3_TX_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART3_TX Pin Configuration!"
#endif

//   <o> USART3_RX Pin <0=>Not Used <1=>PB11 <2=>PC11 <3=>PD9 <4=>PC5
#define   RTE_USART3_RX_ID              0
#if      (RTE_USART3_RX_ID == 0)
  #define RTE_USART3_RX                 0
#elif    (RTE_USART3_RX_ID == 1)
  #define RTE_USART3_RX                 1
  #define RTE_USART3_RX_PORT            GPIO_PORT_B
  #define RTE_USART3_RX_PIN             GPIO_PIN_11
  #define RTE_USART3_RX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART3_RX_ID == 2)
  #define RTE_USART3_RX                 1
  #define RTE_USART3_RX_PORT            GPIO_PORT_C
  #define RTE_USART3_RX_PIN             GPIO_PIN_11
  #define RTE_USART3_RX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART3_RX_ID == 3)
  #define RTE_USART3_RX                 1
  #define RTE_USART3_RX_PORT            GPIO_PORT_D
  #define RTE_USART3_RX_PIN             GPIO_PIN_9
  #define RTE_USART3_RX_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART3_RX_ID == 4)
  #define RTE_USART3_RX                 1
  #define RTE_USART3_RX_PORT            GPIO_PORT_C
  #define RTE_USART3_RX_PIN             GPIO_PIN_5
  #define RTE_USART3_RX_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART3_RX Pin Configuration!"
#endif

//   <o> USART3_CK Pin <0=>Not Used <1=>PB12 <2=>PC12 <3=>PD10
#define   RTE_USART3_CK_ID              0
#if      (RTE_USART3_CK_ID == 0)
  #define RTE_USART3_CK                 0
#elif    (RTE_USART3_CK_ID == 1)
  #define RTE_USART3_CK                 1
  #define RTE_USART3_CK_PORT            GPIO_PORT_B
  #define RTE_USART3_CK_PIN             GPIO_PIN_12
  #if defined (STM32F413xx) || defined (STM32F423xx)
    #define RTE_USART3_CK_FUNC          GPIO_PIN_FUNC_8
  #else
    #define RTE_USART3_CK_FUNC          GPIO_PIN_FUNC_7
  #endif
#elif    (RTE_USART3_CK_ID == 2)
  #define RTE_USART3_CK                 1
  #define RTE_USART3_CK_PORT            GPIO_PORT_C
  #define RTE_USART3_CK_PIN             GPIO_PIN_12
  #define RTE_USART3_CK_FUNC            GPIO_PIN_FUNC_7
#elif    (RTE_USART3_CK_ID == 3)
  #define RTE_USART3_CK                 1
  #define RTE_USART3_CK_PORT            GPIO_PORT_D
  #define RTE_USART3_CK_PIN             GPIO_PIN_10
  #define RTE_USART3_CK_FUNC            GPIO_PIN_FUNC_7
#else
  #error "Invalid USART3_CK Pin Configuration!"
#endif

//   <o> USART3_CTS Pin <0=>Not Used <1=>PB13 <2=>PD11
#define   RTE_USART3_CTS_ID             0
#if      (RTE_USART3_CTS_ID == 0)
  #define RTE_USART3_CTS                0
#elif    (RTE_USART3_CTS_ID == 1)
  #define RTE_USART3_CTS                1
  #define RTE_USART3_CTS_PORT           GPIO_PORT_B
  #define RTE_USART3_CTS_PIN            GPIO_PIN_13
  #if defined (STM32F413xx) || defined (STM32F423xx)
    #define RTE_USART3_CTS_FUNC         GPIO_PIN_FUNC_8
  #else
    #define RTE_USART3_CTS_FUNC         GPIO_PIN_FUNC_7
  #endif
#elif    (RTE_USART3_CTS_ID == 2)
  #define RTE_USART3_CTS                1
  #define RTE_USART3_CTS_PORT           GPIO_PORT_D
  #define RTE_USART3_CTS_PIN            GPIO_PIN_11
  #define RTE_USART3_CTS_FUNC           GPIO_PIN_FUNC_7
#else
  #error "Invalid USART3_CTS Pin Configuration!"
#endif

//   <o> USART3_RTS Pin <0=>Not Used <1=>PB14 <2=>PD12
#define   RTE_USART3_RTS_ID             0
#if      (RTE_USART3_RTS_ID == 0)
  #define RTE_USART3_RTS                0
#elif    (RTE_USART3_RTS_ID == 1)
  #define RTE_USART3_RTS                1
  #define RTE_USART3_RTS_PORT           GPIO_PORT_B
  #define RTE_USART3_RTS_PIN            GPIO_PIN_14
  #define RTE_USART3_RTS_FUNC           GPIO_PIN_FUNC_7
#elif    (RTE_USART3_RTS_ID == 2)
  #define RTE_USART3_RTS                1
  #define RTE_USART3_RTS_PORT           GPIO_PORT_D
  #define RTE_USART3_RTS_PIN            GPIO_PIN_12
  #define RTE_USART3_RTS_FUNC           GPIO_PIN_FUNC_7
#else
  #error "Invalid USART3_RTS Pin Configuration!"
#endif

