koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
//   <o> UART5_RX Pin <0=>Not Used <1=>PD2 <2=>PB5 <3=>PB8 <4=>PB12
#define   RTE_UART5_RX_ID               0
#if      (RTE_UART5_RX_ID == 0)
  #define RTE_UART5_RX                  0
#elif    (RTE_UART5_RX_ID == 1)
  #define RTE_UART5_RX                  1
  #define RTE_UART5_RX_PORT             GPIO_PORT_D
  #define RTE_UART5_RX_PIN              GPIO_PIN_2
  #define RTE_UART5_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART5_RX_ID == 2)
  #define RTE_UART5_RX                  1
  #define RTE_UART5_RX_PORT             GPIO_PORT_B
  #define RTE_UART5_RX_PIN              GPIO_PIN_5
  #define RTE_UART5_RX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART5_RX_ID == 3)
  #define RTE_UART5_RX                  1
  #define RTE_UART5_RX_PORT             GPIO_PORT_B
  #define RTE_UART5_RX_PIN              GPIO_PIN_8
  #define RTE_UART5_RX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART5_RX_ID == 4)
  #define RTE_UART5_RX                  1
  #define RTE_UART5_RX_PORT             GPIO_PORT_B
  #define RTE_UART5_RX_PIN              GPIO_PIN_12
  #define RTE_UART5_RX_FUNC             GPIO_PIN_FUNC_11
#else
  #error "Invalid UART5_RX Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0
//     <i>  Selects DMA Stream (only Stream 0 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART5_RX_DMA                0
#define RTE_UART5_RX_DMA_NUMBER         1
#define RTE_UART5_RX_DMA_STREAM         0
#define RTE_UART5_RX_DMA_CHANNEL        4
#define RTE_UART5_RX_DMA_PRIORITY       0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <4=>4 <8=>8
//     <i>  Selects DMA Channel (only Channel 4 or 8 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART5_TX_DMA                0
#define RTE_UART5_TX_DMA_NUMBER         1
#define RTE_UART5_TX_DMA_STREAM         7
#define RTE_UART5_TX_DMA_CHANNEL        4
#define RTE_UART5_TX_DMA_PRIORITY       0

// </e> UART5 (Universal asynchronous receiver transmitter) [Driver_USART5]

// <e> USART6 (Universal synchronous asynchronous receiver transmitter) [Driver_USART6]
// <i> Configuration settings for Driver_USART6 in component ::CMSIS Driver:USART
#define RTE_USART6                      0

//   <o> USART6_TX Pin <0=>Not Used <1=>PA11 <2=>PC6 <3=>PG14
#define   RTE_USART6_TX_ID              0
#if      (RTE_USART6_TX_ID == 0)
  #define RTE_USART6_TX                 0
#elif    (RTE_USART6_TX_ID == 1)
  #define RTE_USART6_TX                 1
  #define RTE_USART6_TX_PORT            GPIO_PORT_A
  #define RTE_USART6_TX_PIN             GPIO_PIN_11
  #define RTE_USART6_TX_FUNC            GPIO_PIN_FUNC_8
#elif    (RTE_USART6_TX_ID == 2)
  #define RTE_USART6_TX                 1
  #define RTE_USART6_TX_PORT            GPIO_PORT_C
  #define RTE_USART6_TX_PIN             GPIO_PIN_6
  #define RTE_USART6_TX_FUNC            GPIO_PIN_FUNC_8
#elif    (RTE_USART6_TX_ID == 3)
  #define RTE_USART6_TX                 1
  #define RTE_USART6_TX_PORT            GPIO_PORT_G
  #define RTE_USART6_TX_PIN             GPIO_PIN_14
  #define RTE_USART6_TX_FUNC            GPIO_PIN_FUNC_8
#else
  #error "Invalid USART6_TX Pin Configuration!"
#endif

//   <o> USART6_RX Pin <0=>Not Used <1=>PA12 <2=>PC7 <3=>PG9
#define   RTE_USART6_RX_ID              0
#if      (RTE_USART6_RX_ID == 0)
  #define RTE_USART6_RX                 0
#elif    (RTE_USART6_RX_ID == 1)
  #define RTE_USART6_RX                 1
  #define RTE_USART6_RX_PORT            GPIO_PORT_A
  #define RTE_USART6_RX_PIN             GPIO_PIN_12
  #define RTE_USART6_RX_FUNC            GPIO_PIN_FUNC_8
#elif    (RTE_USART6_RX_ID == 2)
  #define RTE_USART6_RX                 1
  #define RTE_USART6_RX_PORT            GPIO_PORT_C
  #define RTE_USART6_RX_PIN             GPIO_PIN_7
  #define RTE_USART6_RX_FUNC            GPIO_PIN_FUNC_8
#elif    (RTE_USART6_RX_ID == 3)
  #define RTE_USART6_RX                 1
  #define RTE_USART6_RX_PORT            GPIO_PORT_G
  #define RTE_USART6_RX_PIN             GPIO_PIN_9
  #define RTE_USART6_RX_FUNC            GPIO_PIN_FUNC_8
#else
  #error "Invalid USART6_RX Pin Configuration!"
#endif

//   <o> USART6_CK Pin <0=>Not Used <1=>PC8 <2=>PG7
#define   RTE_USART6_CK_ID              0
#if      (RTE_USART6_CK_ID == 0)
  #define RTE_USART6_CK                 0
#elif    (RTE_USART6_CK_ID == 1)
  #define RTE_USART6_CK                 1
  #define RTE_USART6_CK_PORT            GPIO_PORT_C
  #define RTE_USART6_CK_PIN             GPIO_PIN_8
  #define RTE_USART6_CK_FUNC            GPIO_PIN_FUNC_8
#elif    (RTE_USART6_CK_ID == 2)
  #define RTE_USART6_CK                 1
  #define RTE_USART6_CK_PORT            GPIO_PORT_G
  #define RTE_USART6_CK_PIN             GPIO_PIN_7
  #define RTE_USART6_CK_FUNC            GPIO_PIN_FUNC_8
#else
  #error "Invalid USART6_CK Pin Configuration!"
#endif

//   <o> USART6_CTS Pin <0=>Not Used <1=>PG13 <2=>PG15
#define   RTE_USART6_CTS_ID             0
#if      (RTE_USART6_CTS_ID == 0)
  #define RTE_USART6_CTS                0
#elif    (RTE_USART6_CTS_ID == 1)
  #define RTE_USART6_CTS                1
  #define RTE_USART6_CTS_PORT           GPIO_PORT_G
  #define RTE_USART6_CTS_PIN            GPIO_PIN_13
  #define RTE_USART6_CTS_FUNC           GPIO_PIN_FUNC_8
#elif    (RTE_USART6_CTS_ID == 2)
  #define RTE_USART6_CTS                1
  #define RTE_USART6_CTS_PORT           GPIO_PORT_G
  #define RTE_USART6_CTS_PIN            GPIO_PIN_15
  #define RTE_USART6_CTS_FUNC           GPIO_PIN_FUNC_8
#else
  #error "Invalid USART6_CTS Pin Configuration!"
#endif

//   <o> USART6_RTS Pin <0=>Not Used <1=>PG8 <2=>PG12
#define   RTE_USART6_RTS_ID             0
#if      (RTE_USART6_RTS_ID == 0)
  #define RTE_USART6_RTS                0
#elif    (RTE_USART6_RTS_ID == 1)
  #define RTE_USART6_RTS                1
  #define RTE_USART6_RTS_PORT           GPIO_PORT_G
  #define RTE_USART6_RTS_PIN            GPIO_PIN_8
  #define RTE_USART6_RTS_FUNC           GPIO_PIN_FUNC_8
#elif    (RTE_USART6_RTS_ID == 2)
  #define RTE_USART6_RTS                1
  #define RTE_USART6_RTS_PORT           GPIO_PORT_G
  #define RTE_USART6_RTS_PIN            GPIO_PIN_12
  #define RTE_USART6_RTS_FUNC           GPIO_PIN_FUNC_8
#else
  #error "Invalid USART6_RTS Pin Configuration!"
#endif

