koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
// </e> UART10 (Universal asynchronous receiver transmitter) [Driver_USART10]

// <e> I2C1 (Inter-integrated Circuit Interface 1) [Driver_I2C1]
// <i> Configuration settings for Driver_I2C1 in component ::Drivers:I2C
#define   RTE_I2C1                      1

//   <o> I2C1_SCL Pin <0=>PB6 <1=>PB8
#define   RTE_I2C1_SCL_PORT_ID          1
#if      (RTE_I2C1_SCL_PORT_ID == 0)
  #define RTE_I2C1_SCL_PORT             GPIO_PORT_B
  #define RTE_I2C1_SCL_PIN              GPIO_PIN_6
  #define RTE_I2C1_SCL_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C1_SCL_PORT_ID == 1)
  #define RTE_I2C1_SCL_PORT             GPIO_PORT_B
  #define RTE_I2C1_SCL_PIN              GPIO_PIN_8
  #define RTE_I2C1_SCL_FUNC             GPIO_PIN_FUNC_4
#else
  #error "Invalid I2C1_SCL Pin Configuration!"
#endif
//   <o> I2C1_SDA Pin <0=>PB7 <1=>PB9
#define   RTE_I2C1_SDA_PORT_ID          0
#if      (RTE_I2C1_SDA_PORT_ID == 0)
  #define RTE_I2C1_SDA_PORT             GPIO_PORT_B
  #define RTE_I2C1_SDA_PIN              GPIO_PIN_7
  #define RTE_I2C1_SDA_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C1_SDA_PORT_ID == 1)
  #define RTE_I2C1_SDA_PORT             GPIO_PORT_B
  #define RTE_I2C1_SDA_PIN              GPIO_PIN_9
  #define RTE_I2C1_SDA_FUNC             GPIO_PIN_FUNC_4
#else
  #error "Invalid I2C1_SDA Pin Configuration!"
#endif
// </e> I2C1 (Inter-integrated Circuit Interface 1) [Driver_I2C1]

// <e> I2C2 (Inter-integrated Circuit Interface 2) [Driver_I2C2]
// <i> Configuration settings for Driver_I2C2 in component ::Drivers:I2C
#define   RTE_I2C2                      0

//   <o> I2C2_SCL Pin <0=>PB10 <1=>PF1 <2=>PH4
#define   RTE_I2C2_SCL_PORT_ID          0
#if      (RTE_I2C2_SCL_PORT_ID == 0)
  #define RTE_I2C2_SCL_PORT             GPIO_PORT_B
  #define RTE_I2C2_SCL_PIN              GPIO_PIN_10
  #define RTE_I2C2_SCL_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C2_SCL_PORT_ID == 1)
  #define RTE_I2C2_SCL_PORT             GPIO_PORT_F
  #define RTE_I2C2_SCL_PIN              GPIO_PIN_1
  #define RTE_I2C2_SCL_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C2_SCL_PORT_ID == 2)
  #define RTE_I2C2_SCL_PORT             GPIO_PORT_H
  #define RTE_I2C2_SCL_PIN              GPIO_PIN_4
  #define RTE_I2C2_SCL_FUNC             GPIO_PIN_FUNC_4
#else
  #error "Invalid I2C2_SCL Pin Configuration!"
#endif
//   <o> I2C2_SDA Pin <0=>PB11 <1=>PF0 <2=>PH5
#define   RTE_I2C2_SDA_PORT_ID          0
#if      (RTE_I2C2_SDA_PORT_ID == 0)
  #define RTE_I2C2_SDA_PORT             GPIO_PORT_B
  #define RTE_I2C2_SDA_PIN              GPIO_PIN_11
  #define RTE_I2C2_SDA_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C2_SDA_PORT_ID == 1)
  #define RTE_I2C2_SDA_PORT             GPIO_PORT_F
  #define RTE_I2C2_SDA_PIN              GPIO_PIN_0
  #define RTE_I2C2_SDA_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C2_SDA_PORT_ID == 2)
  #define RTE_I2C2_SDA_PORT             GPIO_PORT_H
  #define RTE_I2C2_SDA_PIN              GPIO_PIN_5
  #define RTE_I2C2_SDA_FUNC             GPIO_PIN_FUNC_4
#else
  #error "Invalid I2C2_SDA Pin Configuration!"
#endif
// </e> I2C2 (Inter-integrated Circuit Interface 2) [Driver_I2C2]

// <e> I2C3 (Inter-integrated Circuit Interface 3) [Driver_I2C3]
// <i> Configuration settings for Driver_I2C3 in component ::Drivers:I2C
#define   RTE_I2C3                      0

//   <o> I2C3_SCL Pin <0=>PA8 <1=>PH7
#define   RTE_I2C3_SCL_PORT_ID          0
#if      (RTE_I2C3_SCL_PORT_ID == 0)
  #define RTE_I2C3_SCL_PORT             GPIO_PORT_A
  #define RTE_I2C3_SCL_PIN              GPIO_PIN_8
  #define RTE_I2C3_SCL_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C3_SCL_PORT_ID == 1)
  #define RTE_I2C3_SCL_PORT             GPIO_PORT_H
  #define RTE_I2C3_SCL_PIN              GPIO_PIN_7
  #define RTE_I2C3_SCL_FUNC             GPIO_PIN_FUNC_4
#else
  #error "Invalid I2C3_SCL Pin Configuration!"
#endif
//   <o> I2C3_SDA Pin <0=>PC9 <1=>PH8
#define   RTE_I2C3_SDA_PORT_ID          0
#if      (RTE_I2C3_SDA_PORT_ID == 0)
  #define RTE_I2C3_SDA_PORT             GPIO_PORT_C
  #define RTE_I2C3_SDA_PIN              GPIO_PIN_9
  #define RTE_I2C3_SDA_FUNC             GPIO_PIN_FUNC_4
#elif    (RTE_I2C3_SDA_PORT_ID == 1)
  #define RTE_I2C3_SDA_PORT             GPIO_PORT_H
  #define RTE_I2C3_SDA_PIN              GPIO_PIN_8
  #define RTE_I2C3_SDA_FUNC             GPIO_PIN_FUNC_4
#else
  #error "Invalid I2C3_SDA Pin Configuration!"
#endif
// </e> I2C3 (Inter-integrated Circuit Interface 3) [Driver_I2C3]

// <e> I2S2 (Inter-IC Sound Interface 2) [Driver_SAI2]
// <i> Configuration settings for Driver_SAI2 in component ::Drivers:SAI
#define   RTE_I2S2                      0

//   <o> I2S2_MCLK Pin <0=>PC6
#define   RTE_I2S2_MCLK_PORT_ID         0
#if      (RTE_I2S2_MCLK_PORT_ID == 0)
  #define RTE_I2S2_MCLK_PORT            GPIO_PORT_C
  #define RTE_I2S2_MCLK_PIN             GPIO_PIN_6
  #define RTE_I2S2_MCLK_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid I2S2_MCLK Pin Configuration!"
#endif
//   <o> I2S2_BCLK Pin <0=>PB10 <1=>PB13 <2=>PI1
#define   RTE_I2S2_BCLK_PORT_ID         1
#if      (RTE_I2S2_BCLK_PORT_ID == 0)
  #define RTE_I2S2_BCLK_PORT            GPIO_PORT_B
  #define RTE_I2S2_BCLK_PIN             GPIO_PIN_10
  #define RTE_I2S2_BCLK_FUNC            GPIO_PIN_FUNC_5
#elif    (RTE_I2S2_BCLK_PORT_ID == 1)
  #define RTE_I2S2_BCLK_PORT            GPIO_PORT_B
  #define RTE_I2S2_BCLK_PIN             GPIO_PIN_13
  #define RTE_I2S2_BCLK_FUNC            GPIO_PIN_FUNC_5
#elif    (RTE_I2S2_BCLK_PORT_ID == 2)
  #define RTE_I2S2_BCLK_PORT            GPIO_PORT_I
  #define RTE_I2S2_BCLK_PIN             GPIO_PIN_1
  #define RTE_I2S2_BCLK_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid I2S2_BCLK Pin Configuration!"
#endif
//   <o> I2S2_WCLK Pin <0=>PB9 <1=>PB12 <2=>PI0
#define   RTE_I2S2_WCLK_PORT_ID         1
#if      (RTE_I2S2_WCLK_PORT_ID == 0)
  #define RTE_I2S2_WCLK_PORT            GPIO_PORT_B
  #define RTE_I2S2_WCLK_PIN             GPIO_PIN_9
  #define RTE_I2S2_WCLK_FUNC            GPIO_PIN_FUNC_5
#elif    (RTE_I2S2_WCLK_PORT_ID == 1)
  #define RTE_I2S2_WCLK_PORT            GPIO_PORT_B
  #define RTE_I2S2_WCLK_PIN             GPIO_PIN_12
  #define RTE_I2S2_WCLK_FUNC            GPIO_PIN_FUNC_5
#elif    (RTE_I2S2_WCLK_PORT_ID == 2)
  #define RTE_I2S2_WCLK_PORT            GPIO_PORT_I
  #define RTE_I2S2_WCLK_PIN             GPIO_PIN_0
  #define RTE_I2S2_WCLK_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid I2S2_WCLK Pin Configuration!"
#endif
//   <o> I2S2_DOUT Pin <0=>PB15 <1=>PC3 <2=>PI3
#define   RTE_I2S2_DOUT_PORT_ID         0
#if      (RTE_I2S2_DOUT_PORT_ID == 0)
  #define RTE_I2S2_DOUT_PORT            GPIO_PORT_B
  #define RTE_I2S2_DOUT_PIN             GPIO_PIN_15
  #define RTE_I2S2_DOUT_FUNC            GPIO_PIN_FUNC_5
#elif    (RTE_I2S2_DOUT_PORT_ID == 1)
  #define RTE_I2S2_DOUT_PORT            GPIO_PORT_C
  #define RTE_I2S2_DOUT_PIN             GPIO_PIN_3
  #define RTE_I2S2_DOUT_FUNC            GPIO_PIN_FUNC_5
#elif    (RTE_I2S2_DOUT_PORT_ID == 2)
  #define RTE_I2S2_DOUT_PORT            GPIO_PORT_I
  #define RTE_I2S2_DOUT_PIN             GPIO_PIN_3
  #define RTE_I2S2_DOUT_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid I2S2_DOUT Pin Configuration!"
#endif
//   <o> I2S2_DIN Pin <0=>PB14 <1=>PC2 <2=>PI2
#define   RTE_I2S2_DIN_PORT_ID          0
#if      (RTE_I2S2_DIN_PORT_ID == 0)
  #define RTE_I2S2_DIN_PORT             GPIO_PORT_B
  #define RTE_I2S2_DIN_PIN              GPIO_PIN_14
  #define RTE_I2S2_DIN_FUNC             GPIO_PIN_FUNC_6
#elif    (RTE_I2S2_DIN_PORT_ID == 1)
  #define RTE_I2S2_DIN_PORT             GPIO_PORT_C
  #define RTE_I2S2_DIN_PIN              GPIO_PIN_2
  #define RTE_I2S2_DIN_FUNC             GPIO_PIN_FUNC_6
#elif    (RTE_I2S2_DIN_PORT_ID == 2)
  #define RTE_I2S2_DIN_PORT             GPIO_PORT_I
  #define RTE_I2S2_DIN_PIN              GPIO_PIN_2
  #define RTE_I2S2_DIN_FUNC             GPIO_PIN_FUNC_6
#else
  #error "Invalid I2S2_DIN Pin Configuration!"
#endif
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3
//     <i>  Selects DMA Stream (only Stream 3 can be used)
//     <o3> Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_I2S2_RX_DMA                 0
#define RTE_I2S2_RX_DMA_NUMBER          1
#define RTE_I2S2_RX_DMA_STREAM          3
#define RTE_I2S2_RX_DMA_CHANNEL         3
#define RTE_I2S2_RX_DMA_PRIORITY        3

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <4=>4
//     <i>  Selects DMA Stream (only Stream 4 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_I2S2_TX_DMA                 0
#define RTE_I2S2_TX_DMA_NUMBER          1
#define RTE_I2S2_TX_DMA_STREAM          4
#define RTE_I2S2_TX_DMA_CHANNEL         0
#define RTE_I2S2_TX_DMA_PRIORITY        3

// </e> I2S2 (Inter-IC Sound Interface 2) [Driver_SAI2]

// <e> I2S3 (Inter-IC Sound Interface 3) [Driver_SAI3]
// <i> Configuration settings for Driver_SAI3 in component ::Drivers:SAI
#define   RTE_I2S3                      0

