koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
//   <o> I2S3_MCLK Pin <0=>PC7
#define   RTE_I2S3_MCLK_PORT_ID         0
#if      (RTE_I2S3_MCLK_PORT_ID == 0)
  #define RTE_I2S3_MCLK_PORT            GPIO_PORT_C
  #define RTE_I2S3_MCLK_PIN             GPIO_PIN_7
  #define RTE_I2S3_MCLK_FUNC            GPIO_PIN_FUNC_6
#else
  #error "Invalid I2S3_MCLK Pin Configuration!"
#endif
//   <o> I2S3_BCLK Pin <0=>PB3 <1=>PC10
#define   RTE_I2S3_BCLK_PORT_ID         1
#if      (RTE_I2S3_BCLK_PORT_ID == 0)
  #define RTE_I2S3_BCLK_PORT            GPIO_PORT_B
  #define RTE_I2S3_BCLK_PIN             GPIO_PIN_3
  #define RTE_I2S3_BCLK_FUNC            GPIO_PIN_FUNC_6
#elif    (RTE_I2S3_BCLK_PORT_ID == 1)
  #define RTE_I2S3_BCLK_PORT            GPIO_PORT_C
  #define RTE_I2S3_BCLK_PIN             GPIO_PIN_10
  #define RTE_I2S3_BCLK_FUNC            GPIO_PIN_FUNC_6
#else
  #error "Invalid I2S3_BCLK Pin Configuration!"
#endif
//   <o> I2S3_WCLK Pin <0=>PA4 <1=>PA15
#define   RTE_I2S3_WCLK_PORT_ID         0
#if      (RTE_I2S3_WCLK_PORT_ID == 0)
  #define RTE_I2S3_WCLK_PORT            GPIO_PORT_A
  #define RTE_I2S3_WCLK_PIN             GPIO_PIN_4
  #define RTE_I2S3_WCLK_FUNC            GPIO_PIN_FUNC_6
#elif    (RTE_I2S3_WCLK_PORT_ID == 1)
  #define RTE_I2S3_WCLK_PORT            GPIO_PORT_A
  #define RTE_I2S3_WCLK_PIN             GPIO_PIN_15
  #define RTE_I2S3_WCLK_FUNC            GPIO_PIN_FUNC_6
#else
  #error "Invalid I2S3_WCLK Pin Configuration!"
#endif
//   <o> I2S3_DOUT Pin <0=>PB5 <1=>PC12
#define   RTE_I2S3_DOUT_PORT_ID         1
#if      (RTE_I2S3_DOUT_PORT_ID == 0)
  #define RTE_I2S3_DOUT_PORT            GPIO_PORT_B
  #define RTE_I2S3_DOUT_PIN             GPIO_PIN_5
  #define RTE_I2S3_DOUT_FUNC            GPIO_PIN_FUNC_6
#elif    (RTE_I2S3_DOUT_PORT_ID == 1)
  #define RTE_I2S3_DOUT_PORT            GPIO_PORT_C
  #define RTE_I2S3_DOUT_PIN             GPIO_PIN_12
  #define RTE_I2S3_DOUT_FUNC            GPIO_PIN_FUNC_6
#else
  #error "Invalid I2S3_DOUT Pin Configuration!"
#endif
//   <o> I2S3_DIN Pin <0=>PB4 <1=>PC11
#define   RTE_I2S3_DIN_PORT_ID          1
#if      (RTE_I2S3_DIN_PORT_ID == 0)
  #define RTE_I2S3_DIN_PORT             GPIO_PORT_B
  #define RTE_I2S3_DIN_PIN              GPIO_PIN_4
  #define RTE_I2S3_DIN_FUNC             GPIO_PIN_FUNC_7
#elif    (RTE_I2S3_DIN_PORT_ID == 1)
  #define RTE_I2S3_DIN_PORT             GPIO_PORT_C
  #define RTE_I2S3_DIN_PIN              GPIO_PIN_11
  #define RTE_I2S3_DIN_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid I2S3_DIN Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0 <2=>2
//     <i>  Selects DMA Stream (only Stream 0 or 2 can be used)
//     <o3> Channel <2=>2 <3=>3
//     <i>  Selects DMA Channel (only Channel 2 or 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_I2S3_RX_DMA                 0
#define RTE_I2S3_RX_DMA_NUMBER          1
#define RTE_I2S3_RX_DMA_STREAM          0
#define RTE_I2S3_RX_DMA_CHANNEL         2
#define RTE_I2S3_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <5=>5 <7=>7
//     <i>  Selects DMA Stream (only Stream 5 or 7 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_I2S3_TX_DMA                 1
#define RTE_I2S3_TX_DMA_NUMBER          1
#define RTE_I2S3_TX_DMA_STREAM          5
#define RTE_I2S3_TX_DMA_CHANNEL         0
#define RTE_I2S3_TX_DMA_PRIORITY        3

// </e> I2S3 (Inter-IC Sound Interface 3) [Driver_SAI3]

// <e> SPI1 (Serial Peripheral Interface 1) [Driver_SPI1]
// <i> Configuration settings for Driver_SPI1 in component ::CMSIS Driver:SPI
#define RTE_SPI1                        0

//   <o> SPI1_MISO Pin <0=>Not Used <1=>PA6 <2=>PB4
#define RTE_SPI1_MISO_PORT_ID           0
#if    (RTE_SPI1_MISO_PORT_ID == 0)
  #define RTE_SPI1_MISO                 0
#elif  (RTE_SPI1_MISO_PORT_ID == 1)
  #define RTE_SPI1_MISO                 1
  #define RTE_SPI1_MISO_PORT            GPIO_PORT_A
  #define RTE_SPI1_MISO_PIN             GPIO_PIN_6
  #define RTE_SPI1_MISO_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI1_MISO_PORT_ID == 2)
  #define RTE_SPI1_MISO                 1
  #define RTE_SPI1_MISO_PORT            GPIO_PORT_B
  #define RTE_SPI1_MISO_PIN             GPIO_PIN_4
  #define RTE_SPI1_MISO_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI1_MISO Pin Configuration!"
#endif

//   <o> SPI1_MOSI Pin <0=>Not Used <1=>PA7 <2=>PB5
#define RTE_SPI1_MOSI_PORT_ID           1
#if    (RTE_SPI1_MOSI_PORT_ID == 0)
  #define RTE_SPI1_MOSI                 0
#elif  (RTE_SPI1_MOSI_PORT_ID == 1)
  #define RTE_SPI1_MOSI                 1
  #define RTE_SPI1_MOSI_PORT            GPIO_PORT_A
  #define RTE_SPI1_MOSI_PIN             GPIO_PIN_7
  #define RTE_SPI1_MOSI_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI1_MOSI_PORT_ID == 2)
  #define RTE_SPI1_MOSI                 1
  #define RTE_SPI1_MOSI_PORT            GPIO_PORT_B
  #define RTE_SPI1_MOSI_PIN             GPIO_PIN_5
  #define RTE_SPI1_MOSI_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI1_MOSI Pin Configuration!"
#endif

//   <o> SPI1_SCK Pin <0=>PA5 <1=>PB3
#define RTE_SPI1_SCK_PORT_ID            0
#if    (RTE_SPI1_SCK_PORT_ID == 0)
  #define RTE_SPI1_SCK_PORT             GPIO_PORT_A
  #define RTE_SPI1_SCK_PIN              GPIO_PIN_5
  #define RTE_SPI1_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI1_SCK_PORT_ID == 1)
  #define RTE_SPI1_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI1_SCK_PIN              GPIO_PIN_3
  #define RTE_SPI1_SCK_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI1_SCK Pin Configuration!"
#endif

//   <o> SPI1_NSS Pin <0=>Not Used <1=>PA4 <2=>PA15
#define RTE_SPI1_NSS_PORT_ID            2
#if    (RTE_SPI1_NSS_PORT_ID == 0)
  #define RTE_SPI1_NSS                  0
#elif  (RTE_SPI1_NSS_PORT_ID == 1)
  #define RTE_SPI1_NSS                  1
  #define RTE_SPI1_NSS_PORT             GPIO_PORT_A
  #define RTE_SPI1_NSS_PIN              GPIO_PIN_4
  #define RTE_SPI1_NSS_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI1_NSS_PORT_ID == 2)
  #define RTE_SPI1_NSS                  1
  #define RTE_SPI1_NSS_PORT             GPIO_PORT_A
  #define RTE_SPI1_NSS_PIN              GPIO_PIN_15
  #define RTE_SPI1_NSS_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI1_NSS Pin Configuration!"
#endif

