koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3
//     <i>  Selects DMA Stream (only Stream 3 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI2_RX_DMA                 0
#define RTE_SPI2_RX_DMA_NUMBER          1
#define RTE_SPI2_RX_DMA_STREAM          3
#define RTE_SPI2_RX_DMA_CHANNEL         0
#define RTE_SPI2_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <4=>4
//     <i>  Selects DMA Stream (only Stream 4 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI2_TX_DMA                 0
#define RTE_SPI2_TX_DMA_NUMBER          1
#define RTE_SPI2_TX_DMA_STREAM          4
#define RTE_SPI2_TX_DMA_CHANNEL         0
#define RTE_SPI2_TX_DMA_PRIORITY        0

// </e>

// <e> SPI3 (Serial Peripheral Interface 3) [Driver_SPI3]
// <i> Configuration settings for Driver_SPI3 in component ::CMSIS Driver:SPI
#define RTE_SPI3                        0

//   <o> SPI3_MISO Pin <0=>Not Used <1=>PB4 <2=>PC11
#define RTE_SPI3_MISO_PORT_ID           0
#if    (RTE_SPI3_MISO_PORT_ID == 0)
  #define RTE_SPI3_MISO                 0
#elif  (RTE_SPI3_MISO_PORT_ID == 1)
  #define RTE_SPI3_MISO                 1
  #define RTE_SPI3_MISO_PORT            GPIO_PORT_B
  #define RTE_SPI3_MISO_PIN             GPIO_PIN_4
  #define RTE_SPI3_MISO_FUNC            GPIO_PIN_FUNC_6
#elif  (RTE_SPI3_MISO_PORT_ID == 2)
  #define RTE_SPI3_MISO                 1
  #define RTE_SPI3_MISO_PORT            GPIO_PORT_C
  #define RTE_SPI3_MISO_PIN             GPIO_PIN_11
  #define RTE_SPI3_MISO_FUNC            GPIO_PIN_FUNC_6
#else
  #error "Invalid SPI3_MISO Pin Configuration!"
#endif

//   <o> SPI3_MOSI Pin <0=>Not Used <1=>PB5 <2=>PC12 <3=>PD6
#define RTE_SPI3_MOSI_PORT_ID           0
#if    (RTE_SPI3_MOSI_PORT_ID == 0)
  #define RTE_SPI3_MOSI                 0
#elif  (RTE_SPI3_MOSI_PORT_ID == 1)
  #define RTE_SPI3_MOSI                 1
  #define RTE_SPI3_MOSI_PORT            GPIO_PORT_B
  #define RTE_SPI3_MOSI_PIN             GPIO_PIN_5
  #define RTE_SPI3_MOSI_FUNC            GPIO_PIN_FUNC_6
#elif  (RTE_SPI3_MOSI_PORT_ID == 2)
  #define RTE_SPI3_MOSI                 1
  #define RTE_SPI3_MOSI_PORT            GPIO_PORT_C
  #define RTE_SPI3_MOSI_PIN             GPIO_PIN_12
  #define RTE_SPI3_MOSI_FUNC            GPIO_PIN_FUNC_6
#elif  (RTE_SPI3_MOSI_PORT_ID == 3)
  #define RTE_SPI3_MOSI                 1
  #define RTE_SPI3_MOSI_PORT            GPIO_PORT_D
  #define RTE_SPI3_MOSI_PIN             GPIO_PIN_6

  #if (defined (STM32F413xx) || defined (STM32F423xx))
    #define RTE_SPI3_MOSI_FUNC          GPIO_PIN_FUNC_5
  #else
    #define RTE_SPI3_MOSI_FUNC          GPIO_PIN_FUNC_6
  #endif

#else
  #error "Invalid SPI3_MOSI Pin Configuration!"
#endif

//   <o> SPI3_SCK Pin <0=>PB3 <1=>PB12 <2=>PC10
#define RTE_SPI3_SCK_PORT_ID            0
#if    (RTE_SPI3_SCK_PORT_ID == 0)
  #define RTE_SPI3_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI3_SCK_PIN              GPIO_PIN_3
  #define RTE_SPI3_SCK_FUNC             GPIO_PIN_FUNC_6
#elif  (RTE_SPI3_SCK_PORT_ID == 1)
  #define RTE_SPI3_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI3_SCK_PIN              GPIO_PIN_12

  #if (defined (STM32F413xx) || defined (STM32F423xx))
    #define RTE_SPI3_SCK_FUNC           GPIO_PIN_FUNC_7
  #else
    #define RTE_SPI3_SCK_FUNC           GPIO_PIN_FUNC_6
  #endif

#elif  (RTE_SPI3_SCK_PORT_ID == 2)
  #define RTE_SPI3_SCK_PORT             GPIO_PORT_C
  #define RTE_SPI3_SCK_PIN              GPIO_PIN_10
  #define RTE_SPI3_SCK_FUNC             GPIO_PIN_FUNC_6
#else
  #error "Invalid SPI3_SCK Pin Configuration!"
#endif

//   <o> SPI3_NSS Pin <0=>Not Used <1=>PA4 <2=>PA15
#define RTE_SPI3_NSS_PORT_ID            0
#if    (RTE_SPI3_NSS_PORT_ID == 0)
  #define RTE_SPI3_NSS                  0
#elif  (RTE_SPI3_NSS_PORT_ID == 1)
  #define RTE_SPI3_NSS                  1
  #define RTE_SPI3_NSS_PORT             GPIO_PORT_A
  #define RTE_SPI3_NSS_PIN              GPIO_PIN_4
  #define RTE_SPI3_NSS_FUNC             GPIO_PIN_FUNC_6
#elif  (RTE_SPI3_NSS_PORT_ID == 2)
  #define RTE_SPI3_NSS                  1
  #define RTE_SPI3_NSS_PORT             GPIO_PORT_A
  #define RTE_SPI3_NSS_PIN              GPIO_PIN_15
  #define RTE_SPI3_NSS_FUNC             GPIO_PIN_FUNC_6
#else
  #error "Invalid SPI3_NSS Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0 <2=>2
//     <i>  Selects DMA Stream (only Stream 0 or 2 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI3_RX_DMA                 0
#define RTE_SPI3_RX_DMA_NUMBER          1
#define RTE_SPI3_RX_DMA_STREAM          0
#define RTE_SPI3_RX_DMA_CHANNEL         0
#define RTE_SPI3_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <5=>5 <7=>7
//     <i>  Selects DMA Stream (only Stream 5 or 7 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI3_TX_DMA                 0
#define RTE_SPI3_TX_DMA_NUMBER          1
#define RTE_SPI3_TX_DMA_STREAM          5
#define RTE_SPI3_TX_DMA_CHANNEL         0
#define RTE_SPI3_TX_DMA_PRIORITY        0

// </e>

// <e> SPI4 (Serial Peripheral Interface 4) [Driver_SPI4]
// <i> Configuration settings for Driver_SPI4 in component ::CMSIS Driver:SPI
#define RTE_SPI4                        0

