koshkin-sergey/mbOS/Examples/Boards/ST/STM32F4DISCOVERY/Common/Config/device_config.h
//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <3=>3 <5=>5
//     <i>  Selects DMA Stream (only Stream 3 or 5 can be used)
//     <o3> Channel <2=>2 <7=>7
//     <i>  Selects DMA Channel (only Channel 2 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI5_RX_DMA                 0
#define RTE_SPI5_RX_DMA_NUMBER          2
#define RTE_SPI5_RX_DMA_STREAM          3
#define RTE_SPI5_RX_DMA_CHANNEL         2
#define RTE_SPI5_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <4=>4 <5=>5 <6=>6
//     <i>  Selects DMA Stream (only Stream 4 or 6 can be used)
//     <o3> Channel <2=>2 <5=>5 <7=>7
//     <i>  Selects DMA Channel (only Channel 2 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI5_TX_DMA                 0
#define RTE_SPI5_TX_DMA_NUMBER          2
#define RTE_SPI5_TX_DMA_STREAM          4
#define RTE_SPI5_TX_DMA_CHANNEL         2
#define RTE_SPI5_TX_DMA_PRIORITY        0

// </e>

// <e> SPI6 (Serial Peripheral Interface 6) [Driver_SPI6]
// <i> Configuration settings for Driver_SPI6 in component ::CMSIS Driver:SPI
#define RTE_SPI6                        0

//   <o> SPI6_MISO Pin <0=>Not Used <1=>PG12
#define RTE_SPI6_MISO_PORT_ID           0
#if    (RTE_SPI6_MISO_PORT_ID == 0)
  #define RTE_SPI6_MISO                 0
#elif  (RTE_SPI6_MISO_PORT_ID == 1)
  #define RTE_SPI6_MISO                 1
  #define RTE_SPI6_MISO_PORT            GPIO_PORT_G
  #define RTE_SPI6_MISO_PIN             GPIO_PIN_12
  #define RTE_SPI6_MISO_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI6_MISO Pin Configuration!"
#endif

//   <o> SPI6_MOSI Pin <0=>Not Used <1=>PG14
#define RTE_SPI6_MOSI_PORT_ID           0
#if    (RTE_SPI6_MOSI_PORT_ID == 0)
  #define RTE_SPI6_MOSI                 0
#elif  (RTE_SPI6_MOSI_PORT_ID == 1)
  #define RTE_SPI6_MOSI                 1
  #define RTE_SPI6_MOSI_PORT            GPIO_PORT_G
  #define RTE_SPI6_MOSI_PIN             GPIO_PIN_14
  #define RTE_SPI6_MOSI_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI6_MOSI Pin Configuration!"
#endif

//   <o> SPI6_SCK Pin <0=>PG13
#define RTE_SPI6_SCK_PORT_ID            0
#if    (RTE_SPI6_SCK_PORT_ID == 0)
  #define RTE_SPI6_SCK_PORT             GPIO_PORT_G
  #define RTE_SPI6_SCK_PIN              GPIO_PIN_13
  #define RTE_SPI6_SCK_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI6_SCK Pin Configuration!"
#endif

//   <o> SPI6_NSS Pin <0=>Not Used <1=>PG8
#define RTE_SPI6_NSS_PORT_ID            0
#if    (RTE_SPI6_NSS_PORT_ID == 0)
  #define RTE_SPI6_NSS                  0
#elif  (RTE_SPI6_NSS_PORT_ID == 1)
  #define RTE_SPI6_NSS                  1
  #define RTE_SPI6_NSS_PORT             GPIO_PORT_G
  #define RTE_SPI6_NSS_PIN              GPIO_PIN_8
  #define RTE_SPI6_NSS_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI6_NSS Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <6=>6
//     <i>  Selects DMA Stream (only Stream 6 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI6_RX_DMA                 0
#define RTE_SPI6_RX_DMA_NUMBER          2
#define RTE_SPI6_RX_DMA_STREAM          6
#define RTE_SPI6_RX_DMA_CHANNEL         1
#define RTE_SPI6_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <5=>5
//     <i>  Selects DMA Stream (only Stream 5 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI6_TX_DMA                 0
#define RTE_SPI6_TX_DMA_NUMBER          2
#define RTE_SPI6_TX_DMA_STREAM          5
#define RTE_SPI6_TX_DMA_CHANNEL         1
#define RTE_SPI6_TX_DMA_PRIORITY        0

// </e>


// <e> USB FS (Universal Serial Bus Fast Speed) [Driver_USB_FS]
// <i> Configuration settings for Driver_USB_FS in component ::CMSIS Driver:USB_FS
#define RTE_USB_FS                      0

//   <o> USB_FS ID Pin <0=>Not Used <1=>PA10
#define   RTE_USB_FS_ID_ID              0
#if      (RTE_USB_FS_ID_ID == 0)
  #define RTE_USB_FS_ID                 0
#elif    (RTE_USB_FS_ID_ID == 1)
  #define RTE_USB_FS_ID                 1
  #define RTE_USB_FS_ID_PORT            GPIO_PORT_A
  #define RTE_USB_FS_ID_PIN             GPIO_PIN_10
  #define RTE_USB_FS_ID_FUNC            GPIO_PIN_FUNC_10
#else
  #error "Invalid USB_FS_ID Pin Configuration!"
#endif

//   <o> USB_FS DP Pin <0=>PA12
#define   RTE_USB_FS_DP_ID              0
#if      (RTE_USB_FS_DP_ID == 0)
  #define RTE_USB_FS_DP                 1
  #define RTE_USB_FS_DP_PORT            GPIO_PORT_A
  #define RTE_USB_FS_DP_PIN             GPIO_PIN_12
  #define RTE_USB_FS_DP_FUNC            GPIO_PIN_FUNC_10
#else
  #error "Invalid USB_FS_DP Pin Configuration!"
#endif

//   <o> USB_FS DM Pin <0=>PA11
#define   RTE_USB_FS_DM_ID              0
#if      (RTE_USB_FS_DM_ID == 0)
  #define RTE_USB_FS_DM                 1
  #define RTE_USB_FS_DM_PORT            GPIO_PORT_A
  #define RTE_USB_FS_DM_PIN             GPIO_PIN_11
  #define RTE_USB_FS_DM_FUNC            GPIO_PIN_FUNC_10
#else
  #error "Invalid USB_FS_DM Pin Configuration!"
#endif

//   <o> USB_FS VBUS Pin <0=>Not Used <1=>PA9
#define   RTE_USB_FS_VBUS_ID            1
#if      (RTE_USB_FS_VBUS_ID == 0)
  #define RTE_USB_FS_VBUS               0
#elif    (RTE_USB_FS_VBUS_ID == 1)
  #define RTE_USB_FS_VBUS               1
  #define RTE_USB_FS_VBUS_PORT          GPIO_PORT_A
  #define RTE_USB_FS_VBUS_PIN           GPIO_PIN_9
#else
  #error "Invalid USB_FS_VBUS Pin Configuration!"
#endif

//   <o> USB_FS SOF Pin <0=>Not Used <1=>PA10
#define   RTE_USB_FS_SOF_ID             0
#if      (RTE_USB_FS_SOF_ID == 0)
  #define RTE_USB_FS_SOF                0
#elif    (RTE_USB_FS_SOF_ID == 1)
  #define RTE_USB_FS_SOF                1
  #define RTE_USB_FS_SOF_PORT           GPIO_PORT_A
  #define RTE_USB_FS_SOF_PIN            GPIO_PIN_8
  #define RTE_USB_FS_SOF_FUNC           GPIO_PIN_FUNC_10
#else
  #error "Invalid USB_FS_SOF Pin Configuration!"
#endif

// </e>

#endif /* DEVICE_CONFIG_H_ */

/* ----------------------------- End of file ---------------------------------*/
